app/Controllers/MainController.php

    public function list()
    {
        $per_page = 5;
        $students = $this->mahasiswaModel->paginate($per_page);
---
SELECT *
FROM `mahasiswa`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `mahasiswa`

    public function view($id)
    {
        $student = $this->mahasiswaModel->find($id);
        $student['tanggal_lahir'] = date_format(date_create($student['tanggal_lahir']), 'd/m/Y') ?? '';
        $campus = $this->campusModel->find($student['campus']);
---
SELECT *
FROM `mahasiswa`
WHERE `mahasiswa`.`id` = '6'
SELECT *
FROM `campus`
WHERE `campus`.`id_campus` = '1'

    public function create()
    {
        $campus = $this->campusModel->findAll();
---
SELECT *
FROM `campus`